{"data":{"site":{"siteMetadata":{"title":"Blog","author":"Parth Shiralkar"}},"markdownRemark":{"id":"ff2b3a6a-0c0b-5a91-8d13-50b6dee76c98","excerpt":"Ever since her little doll had gone missing, Emma Whelker had become increasingly and increasingly morose. Not being able to play with a toy for less than a day…","html":"<p>Ever since her little doll had gone missing, Emma Whelker had become increasingly and increasingly morose. Not being able to play with a toy for less than a day held a far deeper significance for twelve-year-old Emma than her parents could fathom.</p>\n<p>It was a Saturday. Emma sat in the verandah of the countryside cottage. Her father tended to the fireplace while her mother talked his ear off about finding her brother a job. The house smelled of honeysuckle and freshly-baked bread. For all intents and purposes, this was a day straight out of a dream. Emma did not think so. Wiping a tear with the back of her hand, she stood up and dusted her clothes off. “Mama!” she called out. “I’m going down to the lake! I’ll be back in time for dinner!”</p>\n<p>“Emma, wait!” her mother huffed. “This girl!”</p>\n<p>Emma’s father smiled and poked the fire a bit more. “She’ll be fine,” he said, and reached out for his wife.</p>\n<p>In the moonlight, Emma ran. Her feet padded along the grass, kicking up small clouds of dew as she bounded across the countryside. It was lush, like a spell had been cast everywhere, infusing every little bit of nature with life.</p>\n<p>The lake was wider than anything Emma had seen, and it reminded her of a calmer place, and so it became her safe space. She came down here to tell the lake about her life. There were frequent monologues at the lake about the boys at school, about the teacher who reminded her of uncle Jakob, about the weird way her nose was shaped, about all the things that made Emma happy, and sad, and sometimes both.</p>\n<p>Today, Emma cried about her doll. “Oh, Zelda!”</p>\n<p>The lake rippled softly in a gentle breeze, a wind that caressed Emma’s face, as though to let her know that yes, we feel your sorrow. Zelda, the toy that Emma had bought from the flea market. Zelda, an even bigger confidante of the shy girl everyone bullied at school. Zelda, who had been missing from the house for the whole day.</p>\n<p>“Oh, Zelda” wailed Emma, running her fingers along the waterline. “I miss you. Jared looked at me today.” Emma grinned. “It was fun! Come back, Zelda.”</p>\n<p>The water gurgled. Emma thought about Zelda’s weird and misshapen face. It gave her confidence. Why, she, Emma, was so much prettier than this ugly doll? Why would I care about the bullies?</p>\n<p>Emma thought about Zelda’s twisted torso, bound together by rags of a child who could perhaps only dream of affording to go to school. Flea markets were fun places, Emma thought.</p>\n<p>The water rippled, a little more roughly than a moment before.</p>","frontmatter":{"title":"Voices from yonder","date":"April 11, 2020","description":"20 minute speedrun"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/voices-from-yonder/","previous":{"fields":{"slug":"/no-shoot-messenger/"},"frontmatter":{"title":"Don't shoot the messenger"}},"next":null}}